In [1]:
import pandas as pd

In [2]:
from mysql.connector import connect, Error
from getpass import getpass

In [3]:
try:
    conn = connect (
       host = 'localhost',
       username = input('Enter your username'),
       password = input('Enter your password'),
       database = 'insurit'
    )
except Error as e:
    print(e)

Enter your username root
Enter your password Anything123#

**DDL - Customer**

CREATE TABLE IF NOT EXISTS Customer (<br>
  Customer_id integer PRIMARY KEY<br>,
  Name varchar(255<br>),
  Phone varchar(25<br>5),
  Email varchar(2<br>55),
  Address varchar(<br>255),
  Driving_license varchar(255)
);

In [4]:
customer = pd.read_csv('customer.csv')

In [5]:
customer.head()

,Customer_id,Name,Phone,Email,Address,Driving_license,Age
0,58082,Alfred Balshen,140-400-3125,abalshen10@bloglines.com,0 Glendale Parkway,Yes,58
1,74341,Cello Fassan,467-460-7623,cfassan1c@google.com.br,70873 Ludington Court,No,66
2,77471,Guthrie Cortese,770-414-1691,gcortesep@about.com,0077 Sheridan Drive,No,65
3,78932,Dorena Kingaby,370-179-1371,dkingaby4@printfriendly.com,13765 Petterle Circle,Yes,54
4,94613,Cassandra Veitch,312-814-1819,cveitchc@cbslocal.com,850 Monument Avenue,Yes,31

In [6]:
customer.shape

(50, 7)

In [7]:
for Customer_id,Name,Phone,Email,Address,Driving_license,Age in customer.values.tolist():
    print("INSERT INTO Customer VALUES ({},'{}','{}','{}','{}','{}',{});".format(Customer_id,Name,Phone,Email,Address,Driving_license,Age))

INSERT INTO Customer VALUES (58082,'Alfred Balshen','140-400-3125','abalshen10@bloglines.com','0 Glendale Parkway','Yes',58);
INSERT INTO Customer VALUES (74341,'Cello Fassan','467-460-7623','cfassan1c@google.com.br','70873 Ludington Court','No',66);
INSERT INTO Customer VALUES (77471,'Guthrie Cortese','770-414-1691','gcortesep@about.com','0077 Sheridan Drive','No',65);
INSERT INTO Customer VALUES (78932,'Dorena Kingaby','370-179-1371','dkingaby4@printfriendly.com','13765 Petterle Circle','Yes',54);
INSERT INTO Customer VALUES (94613,'Cassandra Veitch','312-814-1819','cveitchc@cbslocal.com','850 Monument Avenue','Yes',31);
INSERT INTO Customer VALUES (109075,'Darrel Gounot','993-434-7131','dgounotw@gizmodo.com','4 West Way','Yes',42);
INSERT INTO Customer VALUES (114971,'Reeva Kupisz','300-253-6630','rkupisz15@moonfruit.com','6910 Bluestem Park','Yes',62);
INSERT INTO Customer VALUES (144402,'Dasha Hiscoe','262-608-3656','dhiscoe18@livejournal.com','6 Northfield Drive','No',18);
INSERT INTO Customer VALUES (166248,'Gisela Kretchmer','668-244-2155','gkretchmerr@list-manage.com','64 Pawling Way','No',78);
INSERT INTO Customer VALUES (174408,'Harri Paolo','790-698-5891','hpaolox@marriott.com','3 Cordelia Center','No',48);
INSERT INTO Customer VALUES (176254,'Correna Stitch','602-865-3223','cstitchj@tripod.com','15296 Bartillon Park','Yes',69);
INSERT INTO Customer VALUES (249650,'Curry Riggs','895-961-5847','criggs1d@independent.co.uk','3 Spenser Hill','No',27);
INSERT INTO Customer VALUES (289060,'Aundrea Abrahmer','470-635-1811','aabrahmerq@yelp.com','600 Haas Terrace','No',67);
INSERT INTO Customer VALUES (293654,'Thomasin Boddymead','867-190-2098','tboddymeadu@domainmarket.com','618 Hanover Street','Yes',51);
INSERT INTO Customer VALUES (319355,'Leda Liffe','768-317-1479','lliffe5@sun.com','17870 Oxford Plaza','Yes',35);
INSERT INTO Customer VALUES (336850,'Arda Calderhead','139-697-7506','acalderheadi@indiatimes.com','736 Sauthoff Point','Yes',76);
INSERT INTO Customer VALUES (345273,'Josee Honeywood','223-375-2439','jhoneywood19@engadget.com','6048 Spaight Parkway','No',71);
INSERT INTO Customer VALUES (352841,'Roderigo Sends','865-535-4858','rsends1@elegantthemes.com','73 Kenwood Terrace','Yes',75);
INSERT INTO Customer VALUES (358893,'Kara-lynn Dallaway','579-654-3410','kdallaway13@bbc.co.uk','4 Milwaukee Park','Yes',54);
INSERT INTO Customer VALUES (365390,'Wilfred Joel','632-327-2233','wjoel16@whitehouse.gov','450 Beilfuss Junction','Yes',74);
INSERT INTO Customer VALUES (389080,'Maurita Kleinplatz','152-738-5550','mkleinplatzh@vimeo.com','69920 Golf View Terrace','No',69);
INSERT INTO Customer VALUES (415216,'Nonnah Trass','370-533-6961','ntrass1a@apache.org','46327 Ludington Place','No',24);
INSERT INTO Customer VALUES (492977,'Darb Tomsen','658-767-5430','dtomseno@mashable.com','31 Forest Run Alley','No',80);
INSERT INTO Customer VALUES (499661,'Edy Toulamain','302-814-3607','etoulamain11@irs.gov','17892 Fairview Junction','No',20);
INSERT INTO Customer VALUES (532909,'Flo Mackett','412-351-4643','fmackettv@princeton.edu','06 Longview Street','Yes',53);
INSERT INTO Customer VALUES (538409,'Alyse Volleth','977-218-2551','avolleth7@hhs.gov','10 Kipling Court','No',24);
INSERT INTO Customer VALUES (554593,'Germain Metzig','782-318-0312','gmetzig2@discuz.net','94 Hoepker Hill','No',50);
INSERT INTO Customer VALUES (555849,'Rochette Dowglass','231-251-7850','rdowglassm@exblog.jp','7906 Marcy Place','Yes',25);
INSERT INTO Customer VALUES (591642,'Derrick Vowells','336-654-2002','dvowellst@cyberchimps.com','77236 Hazelcrest Trail','No',76);
INSERT INTO Customer VALUES (621200,'Augie Chene','745-190-9290','achenel@omniture.com','766 4th Parkway','Yes',53);
INSERT INTO Customer VALUES (628418,'Sianna Scay','128-774-9848','sscayd@nps.gov','9230 Waxwing Hill','Yes',40);
INSERT INTO Customer VALUES (632251,'Bendicty Gogay','162-986-3633','bgogayy@toplist.cz','164 Forest Plaza','Yes',29);
INSERT INTO Customer VALUES (638484,'Angie Attow','343-925-7380','aattowk@mapy.cz','05 Summerview Junction','Yes',68);
INSERT INTO Customer VALUES (640537,'Constanta Beresfore','453-864-6762','cberesfore9@cargocollective.com','35432 Charing Cross Avenue','No',31);
INSERT INTO Customer VALUES (719439,'Hailey Titchener','160-664-3603','htitchener6@cnet.com','33085 Meadow Vale Way','Yes',66);
INSERT INTO Customer VALUES (733572,'Dmitri Simmen','228-899-5566','dsimmen1b@hibu.com','505 Gateway Street','No',72);
INSERT INTO Customer VALUES (778711,'Hattie Kevern','564-480-9848','hkevern3@nyu.edu','40 Valley Edge Circle','Yes',44);
INSERT INTO Customer VALUES (830875,'Hendrika Keynes','174-384-6234','hkeyness@businessinsider.com','1 Sommers Way','No',45);
INSERT INTO Customer VALUES (847339,'Brittney Mash','690-401-9216','bmashb@nationalgeographic.com','24753 Walton Trail','Yes',51);
INSERT INTO Customer VALUES (867938,'Ricki Rayner','643-725-5750','rrayner14@alexa.com','956 Loftsgordon Point','Yes',54);
INSERT INTO Customer VALUES (871428,'Elfreda Callander','143-883-7368','ecallandera@gnu.org','8828 Forest Run Avenue','No',80);
INSERT INTO Customer VALUES (872585,'Karilynn Seymour','207-292-0041','kseymour17@blogtalkradio.com','2 East Parkway','Yes',36);
INSERT INTO Customer VALUES (915790,'Erina Neligan','755-787-5609','eneligang@delicious.com','7 Summit Trail','Yes',33);
INSERT INTO Customer VALUES (930301,'Hoebart Guidone','751-282-1295','hguidonef@hubpages.com','78 Thompson Hill','No',66);
INSERT INTO Customer VALUES (950610,'Hilary Pockett','278-453-0517','hpockett12@dailymail.co.uk','3323 International Road','Yes',22);
INSERT INTO Customer VALUES (972654,'Berkly OGlessane','326-742-8192','boglessanen@chicagotribune.com','42236 Clove Plaza','Yes',31);
INSERT INTO Customer VALUES (974101,'Carlo Grimm','786-476-8508','cgrimme@house.gov','601 Upham Center','Yes',42);
INSERT INTO Customer VALUES (979749,'Thalia Raitie','846-557-5060','traitie8@comcast.net','3 Melody Circle','No',39);
INSERT INTO Customer VALUES (981115,'Antonius Freschini','600-340-9348','afreschiniz@behance.net','610 Transport Parkway','Yes',80);
INSERT INTO Customer VALUES (987673,'Bidget Keaton','778-475-2740','bkeaton0@netvibes.com','4134 Jenifer Circle','Yes',56);

**DDL - Agents:**

CREATE TABLE IF NOT EXISTS Agents( <br>
  Agent_id integer PRIMARY KEY <br>,
  Name varchar(255<br>),
  Email varchar(25<br>5),
  Phone varchar(2<br>55),
  Salary in <br>teger
);

In [11]:
agents = pd.read_csv('AGENTS.csv')

In [12]:
agents.head()

,Agent_id,Name,Phone,Email,Salary
0,6768,Brunhilda Smyley,611-265-3125,bsmyley2@topsy.com,547082
1,13041,Raddie Basson,560-368-3460,rbassona@psu.edu,300977
2,33645,Worden Rosedale,342-776-4301,wrosedalec@over-blog.com,163238
3,52121,Kaitlin Ruter,188-177-5814,kruter3@wikimedia.org,525745
4,69259,Bonnibelle Manchett,839-488-0561,bmanchett9@buzzfeed.com,552776

In [13]:
agents.shape

(13, 5)

In [15]:
for Agent_id,Name,Phone,Email,Salary in agents.values.tolist():
    print("INSERT INTO Agents VALUES ({},'{}','{}','{}',{});".format(Agent_id,Name,Email,Phone,Salary))

INSERT INTO Agents VALUES (6768,'Brunhilda Smyley','bsmyley2@topsy.com','611-265-3125',547082);
INSERT INTO Agents VALUES (13041,'Raddie Basson','rbassona@psu.edu','560-368-3460',300977);
INSERT INTO Agents VALUES (33645,'Worden Rosedale','wrosedalec@over-blog.com','342-776-4301',163238);
INSERT INTO Agents VALUES (52121,'Kaitlin Ruter','kruter3@wikimedia.org','188-177-5814',525745);
INSERT INTO Agents VALUES (69259,'Bonnibelle Manchett','bmanchett9@buzzfeed.com','839-488-0561',552776);
INSERT INTO Agents VALUES (73812,'Bertha Gibbe','bgibbe5@mapquest.com','688-502-8799',820523);
INSERT INTO Agents VALUES (78600,'Veronika Pestricke','vpestrickeb@hhs.gov','832-194-4030',295584);
INSERT INTO Agents VALUES (80340,'Lynnell Pixton','lpixton1@yellowbook.com','297-990-1742',852715);
INSERT INTO Agents VALUES (85926,'Joshuah Devas','jdevas4@google.es','820-918-3141',734363);
INSERT INTO Agents VALUES (92085,'Erinn Minchindon','eminchindon7@theatlantic.com','436-379-1334',318714);
INSERT INTO Agents VALUES (92900,'Rhonda Mayhead','rmayhead8@bloomberg.com','881-274-4756',400885);
INSERT INTO Agents VALUES (95189,'Stefa Cours','scours6@odnoklassniki.ru','882-723-7290',755473);
INSERT INTO Agents VALUES (97444,'Eolanda Tillerton','etillerton0@nydailynews.com','530-528-4376',512292);

**DDL - AutoPolicyDetail:**

CREATE TABLE IF NOT EXISTS AutoPolicy_detail(<br>
  Auto_Policy_id integer PRIMARY KEY<br>,
  Name varchar(255<br>),
  Type varchar(25<br>5),
  Description varchar(2<br>55),
  Policy_active_flag varchar(<br>255),
  Sum_assured in<br>teger,
  Tenure i<br>nteger,
  Policy_type varchar(255)
);

In [15]:
auto = pd.read_csv('auto_policy_detail.csv')

In [16]:
auto.head()

,Policy_id,Name,Type,Description,Policy_active_flag,Sum_assured,Tenure,Policy_type
0,111,Comprehensive Car Care,Sedan,This policy covers all types of sedans and off...,Active,50000,12,Auto
1,112,Off-Road Adventure Shield,SUV,"Designed for SUVs and off-road vehicles, this ...",Active,70000,24,Auto
2,113,Oriental Motor Plan,Motorbike,"Tailored for motorcycles, this policy covers d...",Active,30000,12,Auto
3,114,Classic Car Elegance,Vintage Cars,"Geared towards vintage and classic cars, this ...",Inactive,100000,60,Auto
4,115,Electric Vehicle EcoShield,Electric Cars,"Tailored for electric cars, this policy covers...",Active,60000,24,Auto

In [31]:
auto.shape

(12, 8)

In [17]:
for Policy_id,Name,Type,Description,Policy_active_flag,Sum_assured,Tenure,Policy_type in auto.values.tolist():
    print("INSERT INTO AutoPolicy_detail VALUES ({},'{}','{}','{}','{}',{},{},'{}');".format(Policy_id,Name,Type,Description,Policy_active_flag,Sum_assured,Tenure,Policy_type))

INSERT INTO AutoPolicy_detail VALUES (111,'Comprehensive Car Care','Sedan','This policy covers all types of sedans and offers comprehensive protection, including coverage for accidents, theft, natural disasters, and medical expenses.','Active',50000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (112,'Off-Road Adventure Shield','SUV','Designed for SUVs and off-road vehicles, this policy provides specialized coverage for damages incurred during off-road adventures, including collisions, rollovers, and towing expenses.','Active',70000,24,'Auto');
INSERT INTO AutoPolicy_detail VALUES (113,'Oriental Motor Plan','Motorbike','Tailored for motorcycles, this policy covers damages resulting from accidents, theft, and third-party liabilities, ensuring the freedom of the open road with peace of mind.','Active',30000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (114,'Classic Car Elegance','Vintage Cars','Geared towards vintage and classic cars, this policy offers extensive coverage for restoration costs, market value, and special roadside assistance, preserving the elegance of your cherished automobile.','Inactive',100000,60,'Auto');
INSERT INTO AutoPolicy_detail VALUES (115,'Electric Vehicle EcoShield','Electric Cars','Tailored for electric cars, this policy covers battery damage, charging equipment, and specialized repairs, promoting eco-friendly driving with dedicated insurance support.','Active',60000,24,'Auto');
INSERT INTO AutoPolicy_detail VALUES (116,'Family safety plan','Sedan','This policy emphasizes safety, covering child seat replacements, medical expenses for passengers, and roadside assistance for families on the go.','Active',50000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (117,'Luxury Sedan Prestige Coverage','Sedan','Catering to luxury sedans, this policy offers specialized coverage for high-end interiors, technology systems, and concierge services, ensuring that every aspect of your luxury driving experience is protected','Active',100000,24,'Auto');
INSERT INTO AutoPolicy_detail VALUES (118,'SafeDrive','Motorbike','Premium policy offering high coverage limits, including coverage for uninsured motorists and roadside assistance.','Active',100000,24,'Auto');
INSERT INTO AutoPolicy_detail VALUES (119,'Guardian Auto Insurance','Electric Cars','Short-term policy with comprehensive coverage, ideal for temporary needs such as rental cars or seasonal driving.','Inactive',60000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (120,'DriveSure Insuranc','SUV','Policy tailored for frequent travelers, offering coverage for rental cars and drivers in multiple states.','Active',80000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (121,'Liberty Auto Assurance','Sedan & SUV','Standard coverage for collisions and comprehensive damages, with optional add-ons for enhanced protection.','Active',50000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (122,'ABC Plan','Sedan & SUV','Basic coverage for liability and medical expenses, suitable for low-risk drivers.','Inactive',40000,12,'Auto');

**DDL - HomePolicyDetail:**

CREATE TABLE IF NOT EXISTS HomePolicy_detail (<br>
  Home_Policy_id integer PRIMARY KEY<br>,
  Name varchar(255<br>),
  Type varchar(25<br>5),
  Description varchar(2<br>55),
  Policy_active_flag varchar(<br>255),
  Sum_assured in<br>teger,
  Tenure i<br>nteger,
  Policy_type varchar(255)
);

In [18]:
home = pd.read_csv('home.csv')

In [19]:
home.head()

,Policy_id,Name,Type,Description,Policy_active_flag,Sum_assured,Tenure,Policy_type
0,100,HomeShield,Rent and Owned,Comprehensive coverage for the structure of th...,Active,300000,12,Home
1,101,SecureHome,Owned,"Premium policy offering high coverage limits, ...",Active,500000,24,Home
2,102,SafeHaven Insurance,Rent and Owned,Basic coverage for the homes structure and ess...,Active,250000,12,Home
3,103,Liberty Home Protection,Owned,"Standard policy covering damages from fire, va...",Inactive,400000,12,Home
4,104,EverGuard Home Insurance,Owned,Long-term coverage with benefits like extended...,Active,350000,36,Home

In [32]:
home.shape

(12, 8)

In [21]:
for Policy_id,Name,Type,Description,Policy_active_flag,Sum_assured,Tenure,Policy_type in home.values.tolist():
    print("INSERT INTO HomePolicy_detail VALUES ({},'{}','{}','{}','{}',{},{},'{}');".format(Policy_id,Name,Type,Description,Policy_active_flag,Sum_assured,Tenure,Policy_type))

INSERT INTO HomePolicy_detail VALUES (100,'HomeShield','Rent and Owned','Comprehensive coverage for the structure of the home, personal belongings, liability protection, and additional living expenses in case of temporary displacement due to covered events.','Active',300000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (101,'SecureHome','Owned','Premium policy offering high coverage limits, including protection against natural disasters, theft, and personal injury liability, with options for custom add-ons.','Active',500000,24,'Home');
INSERT INTO HomePolicy_detail VALUES (102,'SafeHaven Insurance','Rent and Owned','Basic coverage for the homes structure and essential belongings, suitable for homeowners seeking affordable protection against common risks.','Active',250000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (103,'Liberty Home Protection','Owned','Standard policy covering damages from fire, vandalism, and certain natural disasters, along with liability coverage for accidents on the property.','Inactive',400000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (104,'EverGuard Home Insurance','Owned','Long-term coverage with benefits like extended replacement cost, which ensures the home can be rebuilt to its original condition even if construction costs rise.','Active',350000,36,'Home');
INSERT INTO HomePolicy_detail VALUES (105,'Guardian Home Assurance','Rent and Owned','Policy offering protection against various perils, including water damage, mold, and coverage for high-value items like jewelry and artwork.','Active',200000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (106,'National Home Protection','Rent','Short-term policy ideal for renters, offering coverage for personal belongings, liability, and temporary living expenses in case of covered events.','Active',100000,24,'Home');
INSERT INTO HomePolicy_detail VALUES (107,'Reliable Home Insurance','Owned','Policy tailored for homeowners with additional structures on their property, such as detached garages or sheds, providing coverage for both the main home and other structures.','Active',100000,24,'Home');
INSERT INTO HomePolicy_detail VALUES (108,'SmartGuard Home Insurance','Owned','Customizable policy allowing homeowners to choose specific coverage limits and endorsements to protect unique assets and accommodate individual needs.','Inactive',350000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (109,'SafeHome Solutions','Owned','High-value policy with features like identity theft protection, credit card coverage, and coverage for unauthorized transactions due to cybercrime.','Active',555000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (110,'HomeAssure Services','Rent','Policy offering coverage for home systems and appliances, such as HVAC, electrical, and plumbing, providing financial protection against unexpected repair or replacement costs.','Active',400000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (111,'One Home Insurance','Owned','Long-term policy with perks like extended coverage for valuables, home office equipment, and reimbursement for temporary housing and meals during repairs.','Inactive',250000,12,'Home');

**DDL - Finance_details**

CREATE TABLE IF NOT EXISTS Finance_details (<br>
  SSN integer,<br>
  Customer_id integer PRIMARY KEY,<br>
  Account_Number varchar(255),<br>
  Income integer,<br>
  Bank_name varchar(255),<br>
  Credit_History varchar(255),<br>
  FOREIGN KEY (Customer_id) REFERENCES Customer(Customer_id)
);

In [22]:
finance = pd.read_csv('finance.csv')

In [23]:
finance.head()

,SSN,Customer_id,Account_Number,Income,Bank_name,Credit_History
0,74216507,58082,6668080649,58317,Wells Fargo,Good
1,465939571,74341,2475885785,30788,Citigroup,Standard
2,813918749,77471,6239350355,106733,Chase,Good
3,853171579,78932,6663340180,4148862,TD Bank,Good
4,226770587,94613,3433461290,88640,Bank of America,Good

In [33]:
finance.shape

(50, 6)

In [24]:
for  SSN,Customer_id,Account_Number,Income,Bank_name,Credit_History in finance.values.tolist():
    print("INSERT INTO Finance_details VALUES ({},{},'{}',{},'{}','{}');".format(SSN,Customer_id,Account_Number,Income,Bank_name,Credit_History))

INSERT INTO Finance_details VALUES (74216507,58082,'6668080649',58317,'Wells Fargo','Good');
INSERT INTO Finance_details VALUES (465939571,74341,'2475885785',30788,'Citigroup','Standard');
INSERT INTO Finance_details VALUES (813918749,77471,'6239350355',106733,'Chase','Good');
INSERT INTO Finance_details VALUES (853171579,78932,'6663340180',4148862,'TD Bank','Good');
INSERT INTO Finance_details VALUES (226770587,94613,'3433461290',88640,'Bank of America','Good');
INSERT INTO Finance_details VALUES (352674436,109075,'4450371309',39642,'Bank of America','Good');
INSERT INTO Finance_details VALUES (212322085,114971,'1631204329',29470,'Wells Fargo','Good');
INSERT INTO Finance_details VALUES (727409990,144402,'6158965543',66567,'TD Bank','Good');
INSERT INTO Finance_details VALUES (925441671,166248,'4674612116',57983,'Bank of America','Bad');
INSERT INTO Finance_details VALUES (204142702,174408,'7788575072',20186,'Citigroup','Good');
INSERT INTO Finance_details VALUES (405467599,176254,'5316421672',32285,'TD Bank','Good');
INSERT INTO Finance_details VALUES (860361556,249650,'1238315826',20574,'TD Bank','Standard');
INSERT INTO Finance_details VALUES (308388791,289060,'8898570629',12600,'Wells Fargo','Good');
INSERT INTO Finance_details VALUES (898940497,293654,'7482284503',43070,'Chase','Standard');
INSERT INTO Finance_details VALUES (101113105,319355,'1590610819',35548,'Chase','Standard');
INSERT INTO Finance_details VALUES (496445947,336850,'4738448888',92047,'Citigroup','Standard');
INSERT INTO Finance_details VALUES (16732103,345273,'5264379216',12910,'Chase','Good');
INSERT INTO Finance_details VALUES (477905881,352841,'8017327721',34848,'Wells Fargo','Good');
INSERT INTO Finance_details VALUES (330960638,358893,'8296876239',71681,'TD Bank','Standard');
INSERT INTO Finance_details VALUES (87226137,365390,'5461846948',72559,'Bank of America','Standard');
INSERT INTO Finance_details VALUES (616368188,389080,'2607184695',92047,'Bank of America','Standard');
INSERT INTO Finance_details VALUES (198089791,415216,'3321119986',20601508,'Wells Fargo','Good');
INSERT INTO Finance_details VALUES (558251337,492977,'2005036558',10183,'TD Bank','Good');
INSERT INTO Finance_details VALUES (772589547,499661,'1702237609',42172,'Bank of America','Standard');
INSERT INTO Finance_details VALUES (992492793,532909,'7884101536',28572,'Wells Fargo','Good');
INSERT INTO Finance_details VALUES (908690212,538409,'3385123187',131313,'Bank of America','Standard');
INSERT INTO Finance_details VALUES (331605414,554593,'1463973416',143163,'Bank of America','Good');
INSERT INTO Finance_details VALUES (486071289,555849,'8404188141',19515,'Bank of America','Bad');
INSERT INTO Finance_details VALUES (251770979,591642,'9144957778',34290,'TD Bank','Bad');
INSERT INTO Finance_details VALUES (547237195,621200,'8889194720',19300,'Wells Fargo','Bad');
INSERT INTO Finance_details VALUES (389894542,628418,'8594077125',54392,'Citigroup','Bad');
INSERT INTO Finance_details VALUES (755517133,632251,'9174445104',18628,'TD Bank','Standard');
INSERT INTO Finance_details VALUES (755180308,638484,'5110480157',97791,'Chase','Good');
INSERT INTO Finance_details VALUES (423776457,640537,'4070604401',114838,'TD Bank','Good');
INSERT INTO Finance_details VALUES (716354628,719439,'7489280966',73928,'Wells Fargo','Standard');
INSERT INTO Finance_details VALUES (518012262,733572,'3546730823',30788,'Bank of America','Standard');
INSERT INTO Finance_details VALUES (180887800,778711,'6120588712',30690,'Citigroup','Good');
INSERT INTO Finance_details VALUES (548039919,830875,'3497327023',20788,'Citigroup','Bad');
INSERT INTO Finance_details VALUES (794174490,847339,'1405124237',33751,'Wells Fargo','Good');
INSERT INTO Finance_details VALUES (397455329,867938,'6898823636',29470,'Chase','Standard');
INSERT INTO Finance_details VALUES (507344117,871428,'1293729161',31371,'Chase','Good');
INSERT INTO Finance_details VALUES (62293192,872585,'3442289093',15566,'Citigroup','Good');
INSERT INTO Finance_details VALUES (878906321,915790,'2633498674',31994,'Wells Fargo','Standard');
INSERT INTO Finance_details VALUES (147766929,930301,'5062457584',25546,'Chase','Bad');
INSERT INTO Finance_details VALUES (835416871,950610,'7899232129',71681,'Citigroup','Standard');
INSERT INTO Finance_details VALUES (605639678,972654,'3995617909',10183,'Citigroup','Bad');
INSERT INTO Finance_details VALUES (761113016,974101,'4373764648',8702,'TD Bank','Bad');
INSERT INTO Finance_details VALUES (744117914,979749,'7821448415',34081,'Citigroup','Good');
INSERT INTO Finance_details VALUES (837455178,981115,'6144703129',12987,'Chase','Standard');
INSERT INTO Finance_details VALUES (224487837,987673,'6247488842',19114,'Chase','Good');

**DDL - Loan**

CREATE TABLE IF NOT EXISTS Loan(<br>
  LoanId varchar(255) PRIMARY KEY<br>,
  LoanType varchar(255<br>),
  Tenure integ<br>er,
  Amount inte<br>ger,
  Customer_id int<br>eger,
  FOREIGN KEY (Customer_id) REFERENCES Customer(Customer_id)
);

In [25]:
loan = pd.read_csv('loan.csv')

In [26]:
loan.head()

     LoanId LoanType  Tenure  Amount  Customer_id
0  LP001015     Home      30  110000       987673
1  LP001022  Vehicle      30  126000       987673
2  LP001031     Home      30  208000       352841
3  LP001035     Home      30  100000       554593
4  LP001051     Home      30   78000       554593

In [28]:
loan.shape

(55, 5)

In [27]:
for LoanId, LoanType, Tenure, Amount, Customer_id in loan.values.tolist():
    print("INSERT INTO Loan VALUES ('{}','{}',{},{},{});".format(LoanId, LoanType, Tenure, Amount, Customer_id))

INSERT INTO Loan VALUES ('LP001015','Home',30,110000,987673);
INSERT INTO Loan VALUES ('LP001022','Vehicle',30,126000,987673);
INSERT INTO Loan VALUES ('LP001031','Home',30,208000,352841);
INSERT INTO Loan VALUES ('LP001035','Home',30,100000,554593);
INSERT INTO Loan VALUES ('LP001051','Home',30,78000,554593);
INSERT INTO Loan VALUES ('LP001054','Home',30,152000,554593);
INSERT INTO Loan VALUES ('LP001055','Home',30,59000,778711);
INSERT INTO Loan VALUES ('LP001056','Vehicle',30,147000,78932);
INSERT INTO Loan VALUES ('LP001059','Home',20,280000,319355);
INSERT INTO Loan VALUES ('LP001067','Home',30,123000,719439);
INSERT INTO Loan VALUES ('LP001078','Vehicle',30,90000,538409);
INSERT INTO Loan VALUES ('LP001082','Home',30,162000,538409);
INSERT INTO Loan VALUES ('LP001083','Home',15,40000,979749);
INSERT INTO Loan VALUES ('LP001094','Vehicle',30,166000,979749);
INSERT INTO Loan VALUES ('LP001096','Vehicle',30,124000,979749);
INSERT INTO Loan VALUES ('LP001099','Vehicle',30,131000,640537);
INSERT INTO Loan VALUES ('LP001105','Vehicle',30,200000,94613);
INSERT INTO Loan VALUES ('LP001107','Vehicle',30,126000,628418);
INSERT INTO Loan VALUES ('LP001108','Vehicle',30,300000,974101);
INSERT INTO Loan VALUES ('LP001115','Vehicle',15,100000,930301);
INSERT INTO Loan VALUES ('LP001121','Home',30,48000,176254);
INSERT INTO Loan VALUES ('LP001124','Home',15,28000,176254);
INSERT INTO Loan VALUES ('LP001128','Home',30,101000,176254);
INSERT INTO Loan VALUES ('LP001135','Home',30,125000,555849);
INSERT INTO Loan VALUES ('LP001149','Home',30,290000,555849);
INSERT INTO Loan VALUES ('LP001153','Home',30,148000,289060);
INSERT INTO Loan VALUES ('LP001163','Home',30,140000,166248);
INSERT INTO Loan VALUES ('LP001169','Home',30,275000,830875);
INSERT INTO Loan VALUES ('LP001174','Vehicle',30,57000,591642);
INSERT INTO Loan VALUES ('LP001176','Vehicle',15,125000,293654);
INSERT INTO Loan VALUES ('LP001177','Home',30,75000,58082);
INSERT INTO Loan VALUES ('LP001183','Home',30,192000,58082);
INSERT INTO Loan VALUES ('LP001185','Home',30,152000,950610);
INSERT INTO Loan VALUES ('LP001187','Home',30,158000,358893);
INSERT INTO Loan VALUES ('LP001190','Home',30,101000,114971);
INSERT INTO Loan VALUES ('LP001203','Vehicle',30,176000,114971);
INSERT INTO Loan VALUES ('LP001208','Vehicle',15,185000,114971);
INSERT INTO Loan VALUES ('LP001210','Vehicle',30,90000,365390);
INSERT INTO Loan VALUES ('LP001211','Vehicle',30,116000,872585);
INSERT INTO Loan VALUES ('LP001219','Vehicle',30,138000,144402);
INSERT INTO Loan VALUES ('LP001220','Home',30,100000,733572);
INSERT INTO Loan VALUES ('LP001221','Home',30,110000,733572);
INSERT INTO Loan VALUES ('LP001226','Home',30,90000,733572);
INSERT INTO Loan VALUES ('LP001230','Home',30,200000,249650);
INSERT INTO Loan VALUES ('LP001231','Home',30,84000,249650);
INSERT INTO Loan VALUES ('LP001232','Home',0,185000,249650);
INSERT INTO Loan VALUES ('LP001237','Home',30,162000,249650);
INSERT INTO Loan VALUES ('LP001242','Home',30,108000,499661);
INSERT INTO Loan VALUES ('LP001268','Home',0,187000,499661);
INSERT INTO Loan VALUES ('LP001270','Home',30,187000,638484);
INSERT INTO Loan VALUES ('LP001284','Home',30,124000,621200);
INSERT INTO Loan VALUES ('LP001287','Home',30,120000,621200);
INSERT INTO Loan VALUES ('LP001291','Home',30,160000,621200);
INSERT INTO Loan VALUES ('LP001298','Home',15,30000,847339);
INSERT INTO Loan VALUES ('LP001312','Vehicle',30,92000,847339);